{
    "de": {
        "nav_about": "Über mich",
        "nav_skills": "Kompetenzen",
        "nav_experience": "Erfahrung",
        "nav_contact": "Kontakt",
        "hero_title": "Aleksandar Trkulja",
        "hero_subtitle": "Senior IT Consultant & Full-Stack Developer",
        "hero_desc": "Über 20 Jahre Erfahrung in Systemadministration, Infrastruktur-Modernisierung und Softwareentwicklung.",
        "btn_contact": "Kontakt aufnehmen",
        "btn_experience": "Mein Werdegang",
        "about_title": "Über mich",
        "about_p1": "Als hochqualifizierter IT-Profi blicke ich auf eine umfangreiche Karriere zurück, die sich über drei Jahrzehnte erstreckt. Meine Leidenschaft liegt in der Lösung komplexer technischer Herausforderungen – sei es durch die Verwaltung robuster Windows-Server-Umgebungen, die Automatisierung von Prozessen mittels Ansible und PowerShell oder die Entwicklung maßgeschneiderter Full-Stack-Lösungen. Dabei lege ich großen Wert auf strukturierte und nachhaltige IT-Dokumentation (LaTeX, Netbox, Wiki).",
        "about_p2": "Meine größte Stärke ist die <strong>IT-Problemlösung</strong> und das <strong>'Thinking-out-of-the-box'</strong>. Ich verbinde tiefes technisches Wissen mit strategischem Denken. Von der Leitung von IT-Abteilungen bis hin zum \"Hands-on\" Troubleshooting – mein Ziel ist es stets, effiziente und zukunftssichere Lösungen zu finden, auch für unkonventionelle Anforderungen.",
        "stat_years": "Jahre Erfahrung",
        "stat_windows": "Jahre Windows Server",
        "stat_virtual": "Jahre Virtualisierung",
        "skills_title": "Kernkompetenzen",
        "skill_windows_title": "Server Administration",
        "skill_virtual_title": "Virtualisierung & Cloud",
        "skill_auto_title": "Automation & Dev",
        "skill_net_title": "Netzwerk & Security",
        "exp_title": "Beruflicher Werdegang",
        "exp_today": "Heute",
        "job1_title": "Senior IT Consultant / Support Engineer",
        "job1_desc": "Beratung von Kunden bei der Infrastrukturmodernisierung und IT-Strategie. Design und Implementierung von Lösungen (Windows/Linux, Virtualisierung). 3rd-Level-Support und Entwicklung von Automatisierungslösungen (Ansible, Python).",
        "job2_title": "IT Manager",
        "job2_desc": "Leitung des gesamten IT-Betriebs und der IT-Strategie. Verantwortung für Budget, Beschaffung und Sicherheit. Führung und Mentoring des IT-Teams.",
        "job3_title": "Senior System Administrator & Developer",
        "job3_desc": "Administration von Windows Servern, Exchange und VMware&nbsp;Umgebungen. Entwicklung eigener Geschäftsanwendungen in C# und&nbsp;.NET. Automatisierung administrativer Aufgaben mittels PowerShell.",
        "job4_title": "IT System Administrator",
        "job4_desc": "Verantwortlich für den kompletten Lebenszyklus von Servern und Workstations. Technischer Support für diverse externe Kunden.",
        "contact_title": "Kontakt",
        "contact_intro": "Haben Sie Interesse an einer Zusammenarbeit oder möchten Sie mehr erfahren? Ich freue mich auf Ihre Nachricht.",
        "footer_rights": "Alle Rechte vorbehalten.",
        "imprint_link": "Impressum",
        "privacy_link": "Datenschutz",
        "imprint_title": "Impressum",
        "imprint_legal": "Angaben gemäß § 5 DDG",
        "imprint_contact": "Kontakt",
        "imprint_responsible": "Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV",
        "nav_home": "Zurück zur Startseite",
        "error_404_title": "404 - Seite nicht gefunden",
        "error_404_desc": "Die angeforderte Seite konnte nicht gefunden werden.",
        "privacy_title": "Datenschutzerklärung",
        "privacy_date": "Stand: 8. Dezember 2025",
        "privacy_preamble_title": "Präambel",
        "privacy_preamble_p1": "Mit der folgenden Datenschutzerklärung möchten wir Sie darüber aufklären, welche Arten Ihrer personenbezogenen Daten (nachfolgend auch kurz als \"Daten\" bezeichnet) wir zu welchen Zwecken und in welchem Umfang verarbeiten. Die Datenschutzerklärung gilt für alle von uns durchgeführten Verarbeitungen personenbezogener Daten, sowohl im Rahmen der Erbringung unserer Leistungen als auch insbesondere auf unseren Webseiten, in mobilen Applikationen sowie innerhalb externer Onlinepräsenzen, wie z. B. unserer Social-Media-Profile (nachfolgend zusammenfassend bezeichnet als \"Onlineangebot\").",
        "privacy_preamble_p2": "Die verwendeten Begriffe sind nicht geschlechtsspezifisch.",
        "privacy_responsible_title": "Verantwortlicher",
        "privacy_responsible_p": "Aleksandar Trkulja<br>Südwall 97<br>41179 Mönchengladbach, Deutschland<br>E-Mail-Adresse: <a href=\"mailto:aleks@trkulja.it\">aleks@trkulja.it</a><br>Impressum: <a href=\"impressum.html\">https://trkulja.it/impressum.html</a>",
        "privacy_overview_title": "Übersicht der Verarbeitungen",
        "privacy_overview_p": "Die nachfolgende Übersicht fasst die Arten der verarbeiteten Daten und die Zwecke ihrer Verarbeitung zusammen und verweist auf die betroffenen Personen.",
        "privacy_types_title": "Arten der verarbeiteten Daten",
        "privacy_types_list": "<li>Bestandsdaten (z.B. Namen, Adressen).</li><li>Kontaktdaten (z.B. E-Mail, Telefonnummern).</li><li>Inhaltsdaten (z.B. Eingaben in Onlineformularen).</li><li>Nutzungsdaten (z.B. besuchte Webseiten, Interesse an Inhalten, Zugriffszeiten).</li><li>Meta-, Kommunikations- und Verfahrensdaten (z.B. IP-Adressen, Zeitangaben, Identifikationsnummern, Consent-Status).</li>",
        "privacy_categories_title": "Kategorien betroffener Personen",
        "privacy_categories_list": "<li>Nutzer (z.B. Webseitenbesucher, Nutzer von Onlinediensten).</li>",
        "privacy_purposes_title": "Zwecke der Verarbeitung",
        "privacy_purposes_list": "<li>Sicherheitsmaßnahmen.</li><li>Bereitstellung unseres Onlineangebotes und Nutzerfreundlichkeit.</li><li>Informationstechnische Infrastruktur (Betrieb und Bereitstellung von Informationssystemen und technischen Geräten).</li>",
        "privacy_legal_basis_title": "Maßgebliche Rechtsgrundlagen",
        "privacy_legal_basis_p": "Im Folgenden erhalten Sie eine Übersicht der Rechtsgrundlagen der DSGVO, auf deren Basis wir personenbezogene Daten verarbeiten.",
        "privacy_legal_basis_list": "<li><strong>Berechtigte Interessen (Art. 6 Abs. 1 S. 1 lit. f) DSGVO)</strong> - Die Verarbeitung ist zur Wahrung der berechtigten Interessen des Verantwortlichen oder eines Dritten notwendig, vorausgesetzt, dass die Interessen, Grundrechte und Grundfreiheiten der betroffenen Person, die den Schutz personenbezogener Daten verlangen, nicht überwiegen.</li>",
        "privacy_security_title": "Sicherheitsmaßnahmen",
        "privacy_security_p1": "Wir treffen nach Maßgabe der gesetzlichen Vorgaben geeignete technische und organisatorische Maßnahmen, um ein dem Risiko angemessenes Schutzniveau zu gewährleisten. Zu den Maßnahmen gehören insbesondere die Sicherung der Vertraulichkeit, Integrität und Verfügbarkeit von Daten.",
        "privacy_security_p2": "<strong>TLS-/SSL-Verschlüsselung (HTTPS):</strong> Um die Daten der Nutzer, die über unsere Online-Dienste übertragen werden, vor unerlaubten Zugriffen zu schützen, setzen wir auf die TLS-/SSL-Verschlüsselungstechnologie. Wenn eine Website durch ein SSL-/TLS-Zertifikat gesichert ist, wird dies durch die Anzeige von HTTPS in der URL signalisiert.",
        "privacy_provision_title": "Bereitstellung des Onlineangebots und Webhosting",
        "privacy_provision_p": "Wir verarbeiten die Daten der Nutzer, um ihnen unsere Online-Dienste zur Verfügung stellen zu können. Zu diesem Zweck verarbeiten wir die IP-Adresse des Nutzers, die notwendig ist, um die Inhalte und Funktionen unserer Online-Dienste an den Browser oder das Endgerät der Nutzer zu übermitteln.",
        "privacy_github_title": "Hosting durch GitHub Pages",
        "privacy_github_p1": "Wir nutzen für unsere Website den Dienst \"GitHub Pages\". Anbieter ist GitHub Inc., 88 Colin P. Kelly Jr. St., San Francisco, CA 94107, USA.",
        "privacy_github_p2": "GitHub erfasst zu Sicherheitszwecken Logfiles (z. B. IP-Adressen), wenn Sie unsere Website besuchen. Rechtsgrundlage ist unser berechtigtes Interesse an der sicheren Bereitstellung unserer Website (Art. 6 Abs. 1 lit. f DSGVO). Die Logfiles werden in der Regel nach einer festgelegten Zeit (meist wenige Tage) automatisch gelöscht.",
        "privacy_github_p3": "Da GitHub seinen Sitz in den USA hat, weisen wir darauf hin, dass Daten dorthin übertragen werden können. Wir berufen uns auf die Standardvertragsklauseln und Sicherheitsgarantien des Anbieters.",
        "privacy_github_p4": "Weitere Informationen zum Datenschutz bei GitHub finden Sie hier: <a href=\"https://docs.github.com/en/site-policy/privacy-policies/github-privacy-statement\" target=\"_blank\">GitHub Privacy Statement</a>.",
        "privacy_cloudflare_title": "Einsatz von Cloudflare (CDN & Sicherheit)",
        "privacy_cloudflare_p1": "Wir nutzen das Content Delivery Network (CDN) und Sicherheitsfunktionen von Cloudflare, Inc., 101 Townsend St, San Francisco, CA 94107, USA.",
        "privacy_cloudflare_p2": "Der Datenverkehr zwischen Ihrem Browser und unserer Website fließt über das Netzwerk von Cloudflare. Hierbei analysiert Cloudflare den Datenverkehr, um Angriffe (z.B. DDoS) abzuwehren und Ladezeiten zu optimieren. Dabei werden technische Daten wie Ihre IP-Adresse verarbeitet.",
        "privacy_cloudflare_p3": "Rechtsgrundlage ist unser berechtigtes Interesse an der Sicherheit und Funktionsfähigkeit unseres Onlineangebots (Art. 6 Abs. 1 lit. f DSGVO). Die Datenübermittlung in die USA wird auf die Standardvertragsklauseln der EU-Kommission gestützt.",
        "privacy_cookies_title": "Einsatz von Cookies und Local Storage",
        "privacy_cookies_general_title": "Allgemeine Hinweise",
        "privacy_cookies_general_p": "Wir setzen auf unserer Website technisch notwendige Speichertechnologien ein. Dazu gehören Cookies oder der lokale Speicher (Local Storage) Ihres Browsers.",
        "privacy_localstorage_title": "Lokaler Speicher (Local Storage)",
        "privacy_localstorage_p1": "Wir nutzen den sogenannten Local Storage Ihres Browsers, um Ihre <strong>bevorzugte Spracheinstellung</strong> (Deutsch/Englisch) zu speichern. Dies stellt sicher, dass Ihnen die Website bei einem erneuten Besuch direkt in der gewünschten Sprache angezeigt wird.",
        "privacy_localstorage_p2": "Dabei werden keine personenbezogenen Daten an Dritte gesendet oder zu Werbezwecken ausgewertet. Rechtsgrundlage ist unser berechtigtes Interesse an einer nutzerfreundlichen Bereitstellung unserer Website (Art. 6 Abs. 1 lit. f DSGVO).",
        "privacy_security_cookies_title": "Sicherheits-Cookies",
        "privacy_security_cookies_p": "Unser Sicherheitsdienstleister Cloudflare setzt unter Umständen technisch notwendige Cookies (z.B. <code>_cf_bm</code>), um bösartige Bots von menschlichen Besuchern zu unterscheiden. Diese Cookies sind für die Sicherheit der Webseite erforderlich und bedürfen keiner Einwilligung.",
        "privacy_deletion_title": "Löschung von Daten",
        "privacy_deletion_p": "Die von uns verarbeiteten Daten werden nach Maßgabe der gesetzlichen Vorgaben gelöscht, sobald sie für die Erfüllung des Zwecks der Verarbeitung nicht mehr erforderlich sind (z.B. Logfiles nach 30 Tagen).",
        "privacy_rights_title": "Rechte der betroffenen Personen",
        "privacy_rights_p": "Ihnen stehen als Betroffene nach der DSGVO verschiedene Rechte zu, insbesondere:",
        "privacy_rights_list": "<li>Widerspruchsrecht (Art. 21 DSGVO)</li><li>Auskunftsrecht (Art. 15 DSGVO)</li><li>Recht auf Berichtigung (Art. 16 DSGVO)</li><li>Recht auf Löschung (Art. 17 DSGVO)</li><li>Recht auf Beschwerde bei einer Aufsichtsbehörde.</li>",
        "privacy_generator_note": "Erstellt mit Hilfe des Datenschutz-Generators von Dr. Thomas Schwenke (angepasst).",
        "privacy_disclaimer": ""
    },
    "en": {
        "nav_about": "About Me",
        "nav_skills": "Skills",
        "nav_experience": "Experience",
        "nav_contact": "Contact",
        "hero_title": "Aleksandar Trkulja",
        "hero_subtitle": "Senior IT Consultant & Full-Stack Developer",
        "hero_desc": "Over 20 years of experience in system administration, infrastructure modernization, and software development.",
        "btn_contact": "Get in Touch",
        "btn_experience": "My Career",
        "about_title": "About Me",
        "about_p1": "As a highly qualified IT professional, I look back on an extensive career spanning three decades. My passion lies in solving complex technical challenges – whether managing robust Windows Server environments, automating processes using Ansible and PowerShell, or developing tailored Full-Stack solutions. I place great emphasis on structured and sustainable IT documentation (LaTeX, Netbox, Wiki).",
        "about_p2": "My greatest strength is <strong>IT problem solving</strong> and <strong>'thinking-out-of-the-box'</strong>. I combine deep technical knowledge with strategic thinking. From leading IT departments to hands-on troubleshooting – my goal is always to find efficient and future-proof solutions, even for unconventional requirements.",
        "stat_years": "Years Experience",
        "stat_windows": "Years Windows Server",
        "stat_virtual": "Years Virtualization",
        "skills_title": "Core Competencies",
        "skill_windows_title": "Server Administration",
        "skill_virtual_title": "Virtualization & Cloud",
        "skill_auto_title": "Automation & Dev",
        "skill_net_title": "Network & Security",
        "exp_title": "Professional Experience",
        "exp_today": "Present",
        "job1_title": "Senior IT Consultant / Support Engineer",
        "job1_desc": "Consulting clients on infrastructure modernization and IT strategy. Design and implementation of solutions (Windows/Linux, virtualization). 3rd-level support and development of automation solutions (Ansible, Python).",
        "job2_title": "IT Manager",
        "job2_desc": "Directing all IT operations and IT strategy. Responsibility for budget, procurement, and security. Leadership and mentoring of the IT team.",
        "job3_title": "Senior System Administrator & Developer",
        "job3_desc": "Administration of Windows Servers, Exchange, and VMware environments. Development of proprietary business applications in C# and .NET. Automation of administrative tasks using PowerShell.",
        "job4_title": "IT System Administrator",
        "job4_desc": "Responsible for the complete lifecycle of servers and workstations. Technical support for various external clients.",
        "contact_title": "Contact",
        "contact_intro": "Are you interested in working together or would you like to know more? I look forward to your message.",
        "footer_rights": "All rights reserved.",
        "imprint_link": "Imprint",
        "privacy_link": "Privacy Policy",
        "imprint_title": "Imprint",
        "imprint_legal": "Information according to § 5 DDG",
        "imprint_contact": "Contact",
        "imprint_responsible": "Responsible for content according to § 55 Abs. 2 RStV",
        "nav_home": "Back to Home",
        "error_404_title": "404 - Page Not Found",
        "error_404_desc": "The requested page could not be found.",
        "privacy_title": "Privacy Policy",
        "privacy_date": "Status: December 8, 2025",
        "privacy_preamble_title": "Preamble",
        "privacy_preamble_p1": "With the following privacy policy, we would like to inform you about the types of your personal data (hereinafter also referred to as \"data\") we process, for what purposes, and to what extent. The privacy policy applies to all processing of personal data carried out by us, both in the context of providing our services and in particular on our websites, in mobile applications, and within external online presences, such as our social media profiles (hereinafter collectively referred to as \"online offer\").",
        "privacy_preamble_p2": "The terms used are not gender-specific.",
        "privacy_responsible_title": "Responsible Person",
        "privacy_responsible_p": "Aleksandar Trkulja<br>Südwall 97<br>41179 Mönchengladbach, Germany<br>Email: <a href=\"mailto:aleks@trkulja.it\">aleks@trkulja.it</a><br>Imprint: <a href=\"impressum.html\">https://trkulja.it/impressum.html</a>",
        "privacy_overview_title": "Overview of Processing",
        "privacy_overview_p": "The following overview summarizes the types of data processed and the purposes of their processing and refers to the data subjects.",
        "privacy_types_title": "Types of Data Processed",
        "privacy_types_list": "<li>Inventory data (e.g., names, addresses).</li><li>Contact data (e.g., email, phone numbers).</li><li>Content data (e.g., entries in online forms).</li><li>Usage data (e.g., visited websites, interest in content, access times).</li><li>Meta, communication, and procedural data (e.g., IP addresses, time information, identification numbers, consent status).</li>",
        "privacy_categories_title": "Categories of Data Subjects",
        "privacy_categories_list": "<li>Users (e.g., website visitors, users of online services).</li>",
        "privacy_purposes_title": "Purposes of Processing",
        "privacy_purposes_list": "<li>Security measures.</li><li>Provision of our online offer and user-friendliness.</li><li>Information technology infrastructure (operation and provision of information systems and technical devices).</li>",
        "privacy_legal_basis_title": "Relevant Legal Bases",
        "privacy_legal_basis_p": "In the following, you will find an overview of the legal bases of the GDPR on which we process personal data.",
        "privacy_legal_basis_list": "<li><strong>Legitimate Interests (Art. 6 para. 1 sentence 1 lit. f) GDPR)</strong> - Processing is necessary for the purposes of the legitimate interests pursued by the controller or by a third party, except where such interests are overridden by the interests or fundamental rights and freedoms of the data subject which require protection of personal data.</li>",
        "privacy_security_title": "Security Measures",
        "privacy_security_p1": "We take appropriate technical and organizational measures in accordance with legal requirements to ensure a level of protection appropriate to the risk. These measures include, in particular, ensuring the confidentiality, integrity, and availability of data.",
        "privacy_security_p2": "<strong>TLS/SSL Encryption (HTTPS):</strong> To protect the data of users transmitted via our online services from unauthorized access, we use TLS/SSL encryption technology. If a website is secured by an SSL/TLS certificate, this is indicated by the display of HTTPS in the URL.",
        "privacy_provision_title": "Provision of the Online Offer and Web Hosting",
        "privacy_provision_p": "We process users\" data to provide them with our online services. For this purpose, we process the user\"s IP address, which is necessary to transmit the content and functions of our online services to the user\"s browser or terminal device.",
        "privacy_github_title": "Hosting by GitHub Pages",
        "privacy_github_p1": "We use the service \"GitHub Pages\" for our website. The provider is GitHub Inc., 88 Colin P. Kelly Jr. St., San Francisco, CA 94107, USA.",
        "privacy_github_p2": "GitHub collects log files (e.g., IP addresses) for security purposes when you visit our website. The legal basis is our legitimate interest in the secure provision of our website (Art. 6 para. 1 lit. f GDPR). The log files are usually automatically deleted after a set period (usually a few days).",
        "privacy_github_p3": "Since GitHub is based in the USA, we point out that data may be transferred there. We rely on the provider\"s standard contractual clauses and security guarantees.",
        "privacy_github_p4": "Further information on data protection at GitHub can be found here: <a href=\"https://docs.github.com/en/site-policy/privacy-policies/github-privacy-statement\" target=\"_blank\">GitHub Privacy Statement</a>.",
        "privacy_cloudflare_title": "Use of Cloudflare (CDN & Security)",
        "privacy_cloudflare_p1": "We use the Content Delivery Network (CDN) and security functions of Cloudflare, Inc., 101 Townsend St, San Francisco, CA 94107, USA.",
        "privacy_cloudflare_p2": "Traffic between your browser and our website flows through the Cloudflare network. Cloudflare analyzes the traffic to ward off attacks (e.g., DDoS) and optimize loading times. Technical data such as your IP address are processed in this context.",
        "privacy_cloudflare_p3": "The legal basis is our legitimate interest in the security and functionality of our online offer (Art. 6 para. 1 lit. f GDPR). Data transfer to the USA is based on the EU Commission\"s standard contractual clauses.",
        "privacy_cookies_title": "Use of Cookies and Local Storage",
        "privacy_cookies_general_title": "General Information",
        "privacy_cookies_general_p": "We use technically necessary storage technologies on our website. These include cookies or the local storage of your browser.",
        "privacy_localstorage_title": "Local Storage",
        "privacy_localstorage_p1": "We use the so-called Local Storage of your browser to save your <strong>preferred language setting</strong> (German/English). This ensures that the website is displayed directly in the desired language when you visit it again.",
        "privacy_localstorage_p2": "No personal data is sent to third parties or evaluated for advertising purposes. The legal basis is our legitimate interest in a user-friendly provision of our website (Art. 6 para. 1 lit. f GDPR).",
        "privacy_security_cookies_title": "Security Cookies",
        "privacy_security_cookies_p": "Our security provider Cloudflare may set technically necessary cookies (e.g., <code>_cf_bm</code>) to distinguish malicious bots from human visitors. These cookies are necessary for the security of the website and do not require consent.",
        "privacy_deletion_title": "Deletion of Data",
        "privacy_deletion_p": "The data processed by us will be deleted in accordance with legal requirements as soon as they are no longer required for the purpose of processing (e.g., log files after 30 days).",
        "privacy_rights_title": "Rights of Data Subjects",
        "privacy_rights_p": "As a data subject, you have various rights under the GDPR, in particular:",
        "privacy_rights_list": "<li>Right to object (Art. 21 GDPR)</li><li>Right of access (Art. 15 GDPR)</li><li>Right to rectification (Art. 16 GDPR)</li><li>Right to erasure (Art. 17 GDPR)</li><li>Right to lodge a complaint with a supervisory authority.</li>",
        "privacy_generator_note": "Created with the help of the data protection generator by Dr. Thomas Schwenke (adapted).",
        "privacy_disclaimer": "<em>Note: This is a convenience translation. In case of legal disputes, the German version is binding.</em>"
    }
}