{
    "de": {
        "nav_about": "Über mich",
        "nav_skills": "Kompetenzen",
        "nav_experience": "Erfahrung",
        "nav_contact": "Kontakt",
        "hero_title": "Aleksandar Trkulja",
        "hero_subtitle": "Senior IT Consultant & Backend Developer",
        "hero_desc": "Über 20 Jahre Erfahrung in Systemadministration, Infrastruktur-Modernisierung und Softwareentwicklung.",
        "btn_contact": "Kontakt aufnehmen",
        "btn_experience": "Mein Werdegang",
        "about_title": "Über mich",
        "about_p1": "Als hochqualifizierter IT-Profi blicke ich auf eine umfangreiche Karriere zurück, die sich über drei Jahrzehnte erstreckt. Meine Leidenschaft liegt in der Lösung komplexer technischer Herausforderungen – sei es durch die Verwaltung robuster Windows-Server-Umgebungen, die Automatisierung von Prozessen mittels Ansible und PowerShell oder die Entwicklung maßgeschneiderter Backend-Lösungen. Dabei lege ich großen Wert auf strukturierte und nachhaltige IT-Dokumentation (LaTeX, Netbox, Wiki).",
        "about_p2": "Meine größte Stärke ist die <strong>IT-Problemlösung</strong> und das <strong>'Thinking-out-of-the-box'</strong>. Ich verbinde tiefes technisches Wissen mit strategischem Denken. Von der Leitung von IT-Abteilungen bis hin zum \"Hands-on\" Troubleshooting – mein Ziel ist es stets, effiziente und zukunftssichere Lösungen zu finden, auch für unkonventionelle Anforderungen.",
        "stat_years": "Jahre Erfahrung",
        "stat_windows": "Jahre Windows Server",
        "stat_virtual": "Jahre Virtualisierung",
        "skills_title": "Kernkompetenzen",
        "skill_windows_title": "Server Administration",
        "skill_virtual_title": "Virtualisierung & Cloud",
        "skill_auto_title": "Automation & Dev",
        "skill_net_title": "Netzwerk & Security",
        "exp_title": "Beruflicher Werdegang",
        "exp_today": "Heute",
        "job1_title": "Senior IT Consultant / Support Engineer",
        "job1_desc": "Beratung von Kunden bei der Infrastrukturmodernisierung und IT-Strategie. Design und Implementierung von Lösungen (Windows/Linux, Virtualisierung). 3rd-Level-Support und Entwicklung von Automatisierungslösungen (Ansible, Python).",
        "job2_title": "IT Manager",
        "job2_desc": "Leitung des gesamten IT-Betriebs und der IT-Strategie. Verantwortung für Budget, Beschaffung und Sicherheit. Führung und Mentoring des IT-Teams.",
        "job3_title": "Senior System Administrator & Developer",
        "job3_desc": "Administration von Windows Servern, Exchange und VMware&nbsp;Umgebungen. Entwicklung eigener Geschäftsanwendungen in C# und&nbsp;.NET. Automatisierung administrativer Aufgaben mittels PowerShell.",
        "job4_title": "IT System Administrator",
        "job4_desc": "Verantwortlich für den kompletten Lebenszyklus von Servern und Workstations. Technischer Support für diverse externe Kunden.",
        "contact_title": "Kontakt",
        "contact_intro": "Haben Sie Interesse an einer Zusammenarbeit oder möchten Sie mehr erfahren? Ich freue mich auf Ihre Nachricht.",
        "footer_rights": "Alle Rechte vorbehalten.",
        "imprint_link": "Impressum",
        "privacy_link": "Datenschutz",
        "imprint_title": "Impressum",
        "imprint_legal": "Angaben gemäß § 5 DDG",
        "imprint_contact": "Kontakt",
        "imprint_responsible": "Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV",
        "nav_home": "Zurück zur Startseite",
        "error_404_title": "404 - Seite nicht gefunden",
        "error_404_desc": "Die angeforderte Seite konnte nicht gefunden werden."
    },
    "en": {
        "nav_about": "About Me",
        "nav_skills": "Skills",
        "nav_experience": "Experience",
        "nav_contact": "Contact",
        "hero_title": "Aleksandar Trkulja",
        "hero_subtitle": "Senior IT Consultant & Backend Developer",
        "hero_desc": "Over 20 years of experience in system administration, infrastructure modernization, and software development.",
        "btn_contact": "Get in Touch",
        "btn_experience": "My Career",
        "about_title": "About Me",
        "about_p1": "As a highly qualified IT professional, I look back on an extensive career spanning three decades. My passion lies in solving complex technical challenges – whether managing robust Windows Server environments, automating processes using Ansible and PowerShell, or developing tailored backend solutions. I place great emphasis on structured and sustainable IT documentation (LaTeX, Netbox, Wiki).",
        "about_p2": "My greatest strength is <strong>IT problem solving</strong> and <strong>'thinking-out-of-the-box'</strong>. I combine deep technical knowledge with strategic thinking. From leading IT departments to hands-on troubleshooting – my goal is always to find efficient and future-proof solutions, even for unconventional requirements.",
        "stat_years": "Years Experience",
        "stat_windows": "Years Windows Server",
        "stat_virtual": "Years Virtualization",
        "skills_title": "Core Competencies",
        "skill_windows_title": "Server Administration",
        "skill_virtual_title": "Virtualization & Cloud",
        "skill_auto_title": "Automation & Dev",
        "skill_net_title": "Network & Security",
        "exp_title": "Professional Experience",
        "exp_today": "Present",
        "job1_title": "Senior IT Consultant / Support Engineer",
        "job1_desc": "Consulting clients on infrastructure modernization and IT strategy. Design and implementation of solutions (Windows/Linux, virtualization). 3rd-level support and development of automation solutions (Ansible, Python).",
        "job2_title": "IT Manager",
        "job2_desc": "Directing all IT operations and IT strategy. Responsibility for budget, procurement, and security. Leadership and mentoring of the IT team.",
        "job3_title": "Senior System Administrator & Developer",
        "job3_desc": "Administration of Windows Servers, Exchange, and VMware environments. Development of proprietary business applications in C# and .NET. Automation of administrative tasks using PowerShell.",
        "job4_title": "IT System Administrator",
        "job4_desc": "Responsible for the complete lifecycle of servers and workstations. Technical support for various external clients.",
        "contact_title": "Contact",
        "contact_intro": "Are you interested in working together or would you like to know more? I look forward to your message.",
        "footer_rights": "All rights reserved.",
        "imprint_link": "Imprint",
        "privacy_link": "Privacy Policy",
        "imprint_title": "Imprint",
        "imprint_legal": "Information according to § 5 DDG",
        "imprint_contact": "Contact",
        "imprint_responsible": "Responsible for content according to § 55 Abs. 2 RStV",
        "nav_home": "Back to Home",
        "error_404_title": "404 - Page Not Found",
        "error_404_desc": "The requested page could not be found."
    }
}